backend/tests/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    
    # Ramp up to target load
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: "Ramp up"
    
    # Sustained high load (10,000+ TPS target)
    - duration: 300
      arrivalRate: 500
      name: "Sustained load"
    
    # Peak load test
    - duration: 60
      arrivalRate: 1000
      name: "Peak load"
    
    # Cool down
    - duration: 60
      arrivalRate: 50
      name: "Cool down"
  
  processor: "./load-test-functions.js"
  
  variables:
    adminUsername: "admin"
    adminPassword: "admin123"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1  # Max 1% error rate
    p95: 2000        # 95th percentile < 2 seconds
    p99: 5000        # 99th percentile < 5 seconds

scenarios:
  # Scenario 1: Voter Registration
  - name: "Register Voters"
    weight: 20
    flow:
      - function: "generateVoterData"
      - post:
          url: "/api/v1/auth/register"
          json:
            aadharNumber: "{{ aadharNumber }}"
            biometricTemplate: "{{ biometricHash }}"
            districtId: "{{ districtId }}"
            email: "voter{{ aadharNumber }}@test.com"
            phoneNumber: "+91{{ aadharNumber }}"
          capture:
            - json: "$.voterId"
              as: "createdVoterId"
          expect:
            - statusCode: 201
  
  # Scenario 2: Biometric Authentication
  - name: "Authenticate Voters"
    weight: 30
    flow:
      - function: "generateVoterData"
      - post:
          url: "/api/v1/auth/biometric"
          json:
            biometricTemplate: "{{ biometricHash }}"
            terminalId: "{{ terminalId }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]  # May fail if voter not registered
  
  # Scenario 3: Cast Vote (Main Load Test)
  - name: "Cast Votes"
    weight: 40
    flow:
      - function: "generateVoterData"
      - function: "measureVoteTime"
      # First authenticate
      - post:
          url: "/api/v1/auth/biometric"
          json:
            biometricTemplate: "{{ biometricHash }}"
            terminalId: "{{ terminalId }}"
          capture:
            - json: "$.token"
              as: "authToken"
      # Then cast vote
      - post:
          url: "/api/v1/votes/cast"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            voterId: "{{ voterId }}"
            electionId: "{{ electionId }}"
            candidateId: "{{ candidateId }}"
            district: "{{ districtId }}"
            biometricHash: "{{ biometricHash }}"
            terminalId: "{{ terminalId }}"
          capture:
            - json: "$.voteId"
              as: "voteId"
            - json: "$.blockchainTxId"
              as: "txId"
          expect:
            - statusCode: [201, 400]  # 400 if already voted
      - function: "reportVoteComplete"
      - think: 1  # 1 second delay between votes
  
  # Scenario 4: Get Results (Read-heavy)
  - name: "Get Election Results"
    weight: 10
    flow:
      - get:
          url: "/api/v1/votes/results/{{ electionId }}"
          expect:
            - statusCode: 200
      - think: 5

# Custom metrics
  plugins:
  metrics-by-endpoint:
    stripQueryString: true
  expect: {}